{"architecture":{"class_name":"Functional","config":{"name":"sequential","trainable":true,"layers":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,4],"dtype":"float32","sparse":false,"ragged":false,"name":"input_1"},"name":"input_1","inbound_nodes":[]},{"class_name":"Dense","config":{"name":"dense","trainable":true,"dtype":"float32","units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense","inbound_nodes":[[["input_1",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":"float32","units":10,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_1","inbound_nodes":[[["dense",0,0,{}]]]},{"class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":"float32","units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"GlorotUniform","config":{"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null},"name":"dense_2","inbound_nodes":[[["dense_1",0,0,{}]]]}],"input_layers":[["input_1",0,0]],"output_layers":[["dense_2",0,0]]},"keras_version":"2.12.0","backend":"tensorflow"},"image_data_format":"channels_last","input_shapes":[[4]],"output_shapes":[[3]],"tests":[{"inputs":[{"shape":[4],"values":["hrT5PspO9D72PdA+zhSvvg=="]}],"outputs":[{"shape":[3],"values":["QDi/PipA3z4rD0M+"]}]}],"trainable_params":{"dense":{"weights":["DxmvvgDf+r1wfNW9s9oPP4J9lD5Mzig+YIQev7jubz69p5s+GAAGPpYkgT6gXqk9ZohRvmjhS77A6VU+Cke+vjAAkT3TIQ8/9IXyPsAvGL5owoi+3WcXv6ie473zKQ+/hG0hv+S8dL5gWLq9QZi2PTGUe75WLHi+5M8IP8MYC7+A76G7IAcCvhXy4D7gnQu+HPufPnmeET/gqj6/KOo+Pg=="],"bias":["AAAAAAAAAAAAAAAAhVQDPiQYFD4AAAAAAAAAAEacr7ySmgI+AAAAAA=="]},"dense_1":{"weights":["DO4YvhoC5b6gfbI9+OqmvoyL+L5autW++k9dvuQ/zr6uwIS+lPP0vupABD+QtJ0+zgUMvmRnTb7KPem+gP/gvmDwFz0sSOG90AIFvWCigb7OmOq+VFQzvuIik769AQG//KBfPuzFh72cfo29bE8Hv2Jttb5KDea++uGsPcPUxTzZRve8vt47PxvsX74e5EO/Yk2/PrGC1b7u6PS+kcNAv3v+UL4Jl1+9fNKkvpqfFT8nAiO/7L0qv8CBsT4Af8s7RJw2Ps1yvb6gIww++MYBv7BtAD9kwfe9V8eEvpClj75kngu/mNFgvpBDBT38qmQ+yLI7viAnnD5BlOy+xq7BvmgjK75SkUG+5M75vtzW1D5U6Sy+kAFiPX9mKL45Mm8+fKUhPr8OlT7fIFk+LLUJPz4jl77Akqy9NkO7vgJMtD5jDjU/yw0iv0yj0r4WGlE/pfmuPrkZhL5mMem+EPAhvkAXzD0kVg8+P/T2vl56xz4KXj2+5BMsPmd9gb5goSc9bta9vpbqwD5cp+W+lO09Pg=="],"bias":["sOPfvVJgA76boHa808XBPQnTFz7wFxe9AAAAAAAAAAAAAAAAtq8xPg=="]},"dense_2":{"weights":["z0JEP+UFZb6LMaS9NmiOPuKtXb83GGg/lUZMPt056L5B0qk+vOKUPgZvorzlY8i+5zbOvuMXlT1CdGW+EMojvw5Lh74xako/xJqzPpbUHb+aBww/mVrZvkBG1z5Y+P+9XDAKv36LT75goa68WMRDvocSNT9rV8s+"],"bias":["10r3vU/gTj7uxUW+"]}},"hash":"3027420191d9928c8636331cb7845190a1b517828d34bb7d4aa3d6ca2488e4e3"}